In [155]:
import pandas as pd 
from sklearn.datasets import fetch_openml
import numpy as np
titanic = fetch_openml('titanic', version = 1,as_frame=True )
df = titanic.frame

In [156]:
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [157]:
df.isnull().sum()

pclass          0
survived        0
name            0
sex             0
age           263
sibsp           0
parch           0
ticket          0
fare            1
cabin        1014
embarked        2
boat          823
body         1188
home.dest     564
dtype: int64

In [158]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   survived   1309 non-null   category
 2   name       1309 non-null   object
 3   sex        1309 non-null   category
 4   age        1046 non-null   float64
 5   sibsp      1309 non-null   int64
 6   parch      1309 non-null   int64
 7   ticket     1309 non-null   object
 8   fare       1308 non-null   float64
 9   cabin      295 non-null    object
 10  embarked   1307 non-null   category
 11  boat       486 non-null    object
 12  body       121 non-null    float64
 13  home.dest  745 non-null    object
dtypes: category(3), float64(3), int64(3), object(5)
memory usage: 116.8+ KB

In [159]:
df.isna().sum()

pclass          0
survived        0
name            0
sex             0
age           263
sibsp           0
parch           0
ticket          0
fare            1
cabin        1014
embarked        2
boat          823
body         1188
home.dest     564
dtype: int64

In [160]:
df.head()
df['age'].fillna(df['age'].median(), inplace = True)

/var/folders/zp/vscvs05x0592xsw316shhq9r0000gn/T/ipykernel_49062/2853215916.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['age'].fillna(df['age'].median(), inplace = True)

In [161]:
df['embarked'].fillna(df['embarked'].mode(), inplace = True)

/var/folders/zp/vscvs05x0592xsw316shhq9r0000gn/T/ipykernel_49062/3760587181.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['embarked'].fillna(df['embarked'].mode(), inplace = True)

In [162]:
data_after_drop = df
df.shape[0]

1309

In [163]:
data_after_drop = data_after_drop.dropna(subset = 'embarked')
data_after_drop.shape[0]

1307

In [164]:
data_after_drop.isnull().sum()
data_after_drop = data_after_drop.dropna(subset = 'fare')
data_after_drop.shape[0]

1306

In [165]:
data_after_drop.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [166]:
new_d = ['pclass', 'sex', 'age','sibsp','parch', 'fare', 'embarked','survived' ]

In [167]:
df = data_after_drop
df = df[new_d]
df.head()

   pclass     sex      age  sibsp  parch      fare embarked survived
0       1  female  29.0000      0      0  211.3375        S        1
1       1    male   0.9167      1      2  151.5500        S        1
2       1  female   2.0000      1      2  151.5500        S        0
3       1    male  30.0000      1      2  151.5500        S        0
4       1  female  25.0000      1      2  151.5500        S        0

In [168]:
df['embarked'].dtype

CategoricalDtype(categories=['C', 'Q', 'S'], ordered=False, categories_dtype=object)

split data

In [169]:
numeric_col = ['pclass', 'age', 'sibsp', 'parch', 'fare']
categorical_data = ['sex', 'embarked']

In [170]:
X = df.drop('survived', axis = 1)
Y = df['survived']

print(X.shape)
print(Y.shape)

X.isnull().sum()

(1306, 7)
(1306,)

pclass      0
sex         0
age         0
sibsp       0
parch       0
fare        0
embarked    0
dtype: int64

In [171]:
df.isnull().sum()
df[categorical_data].head()

      sex embarked
0  female        S
1    male        S
2  female        S
3    male        S
4  female        S

data transforming 1. onehotencoder for categorical data; it categories data in 1,2,3's

In [172]:
from sklearn.preprocessing import OneHotEncoder

encoder = OneHotEncoder()
encoded = encoder.fit_transform(df[categorical_data])

In [173]:
encoded_df = pd.DataFrame(encoded.toarray(), columns = encoder.get_feature_names_out(['sex','embarked']))

In [174]:
encoded_df.head()

   sex_female  sex_male  embarked_C  embarked_Q  embarked_S
0         1.0       0.0         0.0         0.0         1.0
1         0.0       1.0         0.0         0.0         1.0
2         1.0       0.0         0.0         0.0         1.0
3         0.0       1.0         0.0         0.0         1.0
4         1.0       0.0         0.0         0.0         1.0

scale numeric columns with standard scaler; makes all numerical value to similar range

In [175]:
from sklearn.preprocessing import StandardScaler

scaler = StandardScaler()
scaled = scaler.fit_transform(df[numeric_col])

scaled_df = pd.DataFrame(scaled, columns = scaler.get_feature_names_out(['pclass', 'age', 'sibsp', 'parch', 'fare']))

In [176]:
scaled_df.head()

     pclass       age     sibsp     parch      fare
0 -1.549301 -0.034861 -0.479763 -0.445612  3.442063
1 -1.549301 -2.219833  0.479763  1.863789  2.286663
2 -1.549301 -2.135549  0.479763  1.863789  2.286663
3 -1.549301  0.042943  0.479763  1.863789  2.286663
4 -1.549301 -0.346074  0.479763  1.863789  2.286663

In [177]:
#merge them both 
x_processed = pd.concat([scaled_df,encoded_df ], axis = 1)
x_processed.head()

,pclass,age,sibsp,parch,fare,sex_female,sex_male,embarked_C,embarked_Q,embarked_S
0,-1.549301,-0.034861,-0.479763,-0.445612,3.442063,1.0,0.0,0.0,0.0,1.0
1,-1.549301,-2.219833,0.479763,1.863789,2.286663,0.0,1.0,0.0,0.0,1.0
2,-1.549301,-2.135549,0.479763,1.863789,2.286663,1.0,0.0,0.0,0.0,1.0
3,-1.549301,0.042943,0.479763,1.863789,2.286663,0.0,1.0,0.0,0.0,1.0
4,-1.549301,-0.346074,0.479763,1.863789,2.286663,1.0,0.0,0.0,0.0,1.0